#пункт 12 частина стаття 10 Закон України "Про публічні закупівлі" https://zakon.rada.gov.ua/laws/show/922-19/ed20210724#Text
#спочатку всі ситуації нульові, тому що умовно договір тільки починає діяти
action_1 = 0 #виконання договору
action_2 = 0 #строк дії і виконання
action_3 = 0 #розірвання

action_1 = int(input('Введіть 0 якщо'
                     ' договір не виконано, інакше, якщо виконано введіть 1: '))
action_2 = int(input('Введіть 0 якщо'
                     ' договір закінчив дію але не виконано, інакше, '
                     'якщо договір закінчив дію і виконано введіть 1: '))
action_3 = int(input('Введіть 0 якщо'
                     ' договір не розірвано, інакше, якщо розірвано введіть 1: '))

if action_1 == 1 or action_2 == 1 or action_3 == 1:
    print('Звітуємо')
else:
    print('Не звітуємо')
